In [ ]:
#Mengeluarkan Kolom Dari Data Frame
#LeonyCornelia-2373002

In [1]:
import pandas as pd

print(pd.__version__)

2.1.4

In [6]:
#Persiapan Data Frame
data = {'nama':['bayu', 'indra', 'devi', 'agni'],
     'jenis_kelamin': ['L', 'L', 'P', 'L'], 
     'usia:': [23, 21, 22, 25]}

df = pd.DataFrame(data)
df

    nama jenis_kelamin  usia:
0   bayu             L     23
1  indra             L     21
2   devi             P     22
3   agni             L     25

In [ ]:
#Mengeluarkan Kolom Dari Data Frame
usia = df.pop('usia').to_frame()

In [15]:
df

    nama jenis_kelamin  usia:
0   bayu             L     23
1  indra             L     21
2   devi             P     22
3   agni             L     25

In [ ]:
usia